Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/norec.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: – Brings back bad memories
nb: – Det vekker dårlige minner

source: He is glad social media makes it so easy to stay closely in touch.
nb: Han er glad sosiale medier gjør det enkelt å ha så nær kontakt.

source: Recently, a complete ban on journeys in and out of Kenya was put in place.
nb: Nylig ble innført fullt inn- og utreiseforbud i Kenya.

source: Therefore, I chose to stay in Norway, says Mhlapeng, who is in Norway to work as a music teacher for a school band in Bergen.
nb: Derfor valgte jeg å bli i Norge, sier Mhlapeng, som er i Norge for å jobbe som musikklærer for skolekorps i Bergen.

source: Translated by Susanne Hoggen Kippersund, Norec Almost 60 youth from Africa and Latin America have come to Norway on exchange through Norec (formerly FK Norway).
nb: Nesten 60 unge fra Afrika og Latin-Amerika har kommet til Norge på utveksling i regi av Norec (tidligere Fredskorpset).

source: By Anne Håskoll-Haugen, freelance journalist
nb: Av Anne Håskoll-Haugen, frilansjournalist

source: It brings back bad memories for many of us in South Africa, Mhlapeng explains to Bistandsaktuelt.
nb: Det vekker dårlige minner for mange av oss i Sør-Afrika, sier Mhlapeng til Bistandsaktuelt.

source: His wife works in a restaurant, but has been laid off temporarily and has lost her income.
nb: Kona jobber i en restaurant, er permittert og har mistet inntekten.

source: But the two 25-year olds are not twiddling their thumbs:
nb: Men de to 25-åringene sitter ikke og tvinner tommeltotter:

source: Together with her colleague Wyclife Ochieng Wamira she came to Norway to work at the youth centre of Bærum Red Cross.
nb: Sammen med kollegaen Wyclife Ochieng Wamira kom hun til Norge for å jobbe på ungdomssenteret til Bærum Røde Kors.

source: Both have a background as Red Cross volunteers from their hometown in Kenya.
nb: Begge har bakgrunn som frivillige i Røde Kors i hver sin hjemlandsby i Kenya.

source: from Johannesburg in South Africa is one of them.
nb: fra Johannesburg i Sør-Afrika er en av dem.

source: – The military is patrolling the streets now.
nb: – Militæret patruljerer gatene nå.

source: Now they live together in an apartment and are glad to have each other.
nb: Nå bor de sammen i en leilighet, og er glad de har hverandre.

source: I am anxious to see what I will return to in August, he says.
nb: Jeg er spent på hva jeg kommer tilbake til i august, sier han.

source: They were in Norway to work, but became stranded in a foreign country.
nb: De kom til Norge for å jobbe, men har blitt korona-faste i et fremmed land.

source: – Even if this situation is without comparison, we must make the best out of it, says Pauline Kimonda Kibet.
nb: – Selv om det er en situasjon uten sammenligning, må vi gjøre det beste ut av det, sier Pauline Kimonda Kibet.
